DELETE FROM course_grade;
DELETE FROM course;
DELETE FROM student;

INSERT INTO student (sn, no, name, gender, enrolled, college, grade, class)  VALUES
    (101, 'S001',  '张一', '男', '2020', '计算机学院', '2','1'),
    (102, 'S002',  '张二', '女', '2020', '计算机学院', '2','1'),
    (103, 'S003',  '张三', '男', '2020', '计算机学院', '2','1'),
    (104, 'S004',  '张四', '女', '2020', '计算机学院', '2','1'),
    (105, 'S005',  '张五', '男', '2020', '计算机学院', '2','2'),
    (106, 'S006',  '张六', '女', '2020', '计算机学院', '2','2'),
    (107, 'S007',  '张七', '男', '2020', '计算机学院', '2','2'),
    (108, 'S008',  '张八', '女', '2020', '计算机学院', '2','2');

INSERT INTO course (sn, no, name)  VALUES 
    (1001, 'C01',  '高数'), 
    (1002, 'C02',  '外语'),
    (1003, 'C03',  '线代'),
    (1004, 'C04',  '运筹'),
    (1005, 'C05',  '马哲');


INSERT INTO course_grade (stu_sn, cou_sn, grade)  VALUES 
    (101, 101,  91), 
    (102, 101,  89),
    (103, 101,  90),
    (101, 102,  89);


    